mini_drive_backend/sa_users_ms/app/controllers/users/registrations_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('leo@gmail.com', '$2a$11$X2qseb8qdNR738xm5KqU.OClwdMup2mTIiPshxerxgsokMpG3LHHO', '2017-11-14 15:45:54', '2017-11-14 15:45:54')
---
  def create
    @user = User.new( user_params )
    if @user.save